controllers/ChatController.php

SELECT * FROM `chat_room`
SELECT * FROM `chat_room` LIMIT 10
SELECT COUNT(*) FROM `chat_room`
---
	public function actionOne(){
		Yii::$app->view->title = "chat room";
		$uid = @Yii::$app->user->getIdentity()->id;
		$query = Room::find();
		$pages = new Pagination(['totalCount' => $query->count(), 'pageSize' => 10]);
		$room = $query->offset($pages->offset)->limit($pages->limit)->all();